In [1]:
import numpy as np
import pandas as pd

## Series - class

In [2]:
import random

random_lista = [random.randint(1,10) for x in range(10)]
print(random_lista)

random_series = pd.Series(random_lista)

print(random_series)

[4, 5, 2, 7, 1, 6, 3, 3, 6, 5]
0    4
1    5
2    2
3    7
4    1
5    6
6    3
7    3
8    6
9    5
dtype: int64

In [3]:
isinstance(random_series, pd.Series)

True

In [4]:
print(f'Min series minsta värde   : {random_series.min()}')
print(f'Min series maximala värde : {random_series.max()}')
print(f'Min series medelvärde     : {random_series.mean()}')

Min series minsta värde   : 1
Min series maximala värde : 7
Min series medelvärde     : 4.2

## DataFrame - class

In [5]:
#obs värdena i vår dictionary behöver INTE vara listor, du kan gott kombinera blanda annat listor, arrays & tuples

students = ('Ali', 'Amir', 'Rozann', 'Sawash')
age = [33, 0.75, 27, 3]
eye_color = np.array(['brown', 'blue', 'green', 'brown'])

min_dictionary = {'students' : students, 'age': age, 'eye color': eye_color}

min_dictionary

{'students': ('Ali', 'Amir', 'Rozann', 'Sawash'),
 'age': [33, 0.75, 27, 3],
 'eye color': array(['brown', 'blue', 'green', 'brown'], dtype='<U5')}

In [6]:
personal_df = pd.DataFrame(min_dictionary)

personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [7]:
personal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   students   4 non-null      object
 1   age        4 non-null      float64
 2   eye color  4 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [20]:
#obs värdena i vår dictionary behöver INTE vara listor, du kan gott kombinera blanda annat listor, arrays & tuples

students = ('Ali', 'Amir', 'Rozann', 'Sawash')
age = [33, 0.75, 27, 3]
eye_color = np.array(['brown', 'blue', 'green', 'brown'])

min_dictionary = {'students' : students, 'age': age, 'eye_color': eye_color}

another_df = pd.DataFrame(min_dictionary, index=['pappa', 'son', 'mamma', 'hund'])

another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [9]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [ ]:
personal_df.info()

## Indexering

In [11]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [12]:
personal_df['students']

0       Ali
1      Amir
2    Rozann
3    Sawash
Name: students, dtype: object

För att indexera på fler kolumner behöver dessa anges i en lista

In [13]:
personal_df[['students', 'age']]

  students    age
0      Ali  33.00
1     Amir   0.75
2   Rozann  27.00
3   Sawash   3.00

Man kan också komma åt sina kolumner genom att behandla de som attribut

In [14]:
personal_df.students

0       Ali
1      Amir
2    Rozann
3    Sawash
Name: students, dtype: object

In [29]:
personal_df['students'][0]

'Ali'

In [31]:
another_df['students']['pappa']

'Ali'

## iloc & loc

**iloc**: mer likt python idexering, som ni är vana vid

**loc**: används för att indexera specifikt på de index som finns

In [40]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [47]:
personal_df.iloc[0]

students       Ali
age           33.0
eye color    brown
Name: 0, dtype: object

In [52]:
personal_df.iloc[0:2]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue

In [54]:
personal_df.iloc[0:2]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue

In [95]:
personal_df.iloc[:]

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [107]:
# first index is row, second index is column

personal_df.iloc[2, 2]

'green'

In [108]:
personal_df.iloc[:2, 1:3]

     age eye color
0  33.00     brown
1   0.75      blue

In [111]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [115]:
personal_df.iloc[1:3, :2]

  students    age
1     Amir   0.75
2   Rozann  27.00

In [94]:
another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [48]:
another_df.iloc[0]

students       Ali
age           33.0
eye_color    brown
Name: pappa, dtype: object

In [50]:
another_df.iloc[0:2]

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue

**loc**

In [117]:
another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [127]:
another_df.loc['son', ['age', 'eye_color']]

age          0.75
eye_color    blue
Name: son, dtype: object

In [153]:
another_df.loc[['son','hund'], ['age', 'eye_color']]

       age eye_color
son   0.75      blue
hund  3.00     brown

In [121]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown

In [149]:
personal_df.loc[1, 'age']

0.75

In [146]:
another_df.loc['pappa':'mamma', 'age':'eye_color']

         age eye_color
pappa  33.00     brown
son     0.75      blue
mamma  27.00     green

In [147]:
another_df

      students    age eye_color
pappa      Ali  33.00     brown
son       Amir   0.75      blue
mamma   Rozann  27.00     green
hund    Sawash   3.00     brown

In [148]:
personal_df

  students    age eye color
0      Ali  33.00     brown
1     Amir   0.75      blue
2   Rozann  27.00     green
3   Sawash   3.00     brown